<?php

return [
    'alert_title'    => 'При обработке формы возникла ошибка|При обработке формы возникло несколько ошибок',
    'saved'          => 'Изменения сохранены',
    'confirm_action' => 'Подтвердите действие',

    'buttons'       => [
        'save'  => 'Сохранить',
        'edit'  => 'Изменить',
        'close' => 'Закрыть',
        'open'  => 'Открыть',
        'view'  => 'Посмотреть'
    ],
    'upload_hint'   => 'Перетащите файлы в данную обласить или кликните сюда',
    'notifications' => [
        'title'     => 'Уведомления',
        'mark_read' => 'Пометить все как прочитано',
        'empty'     => 'Уведомления отсутствуют'
    ]
];
