<?php

return [
    'singular' => 'Категория',
    'plural'   => 'Категории',

    'column' => [
        'offer_type_id' => 'Родительская категория',
        'parent_id'     => 'Родительская категория',
    ],

    'field' => [
        'id'        => '#',
        'offerType' => 'Тип работы',

        'alias'  => 'Псевдоним',
        'active' => 'Активный',
        'parent' => 'Родительская категория',
        'title'  => 'Заголовок',
        'icon'   => 'Иконка',
        'order'  => 'Сортировка',
    ],
];
