<?php

return [
    'singular' => 'Назначение предложения',
    'plural'   => 'Назначении предложений',

    'column' => [
        'offer_type_id' => 'Тип предложения',
    ],

    'field' => [
        'id'           => '#',
        'offerType'    => 'Тип работы',
        'title'        => 'Название',
        'icon'         => 'Иконка',
        'alias'        => 'Псевдоним',
        'active'       => 'Активный',
        'optionGroups' => 'Группы опций',
        'order'        => 'Сортировка',
    ],
];
