<?php

return [
    'singular' => 'Группа опций',
    'plural'   => 'Группа опций',

    'column' => [
        'id'     => '#',
        'title'  => 'Название',
        'alias'  => 'Псевдоним',
        'icon'   => 'Иконка',
        'active' => 'Активен',
    ],

    'field' => [
        'id'          => '#',
        'title'       => 'Название',
        'description' => 'Описание',
        'alias'       => 'Псевдоним',
        'icon'        => 'Иконка',
        'active'      => 'Активен',
        'order'       => 'Сортировка',
        'offerTypes'  => 'Тип работы',
        'type'        => 'Тип группы',
    ],

    'enum' => [
        'type' => [
            'extra' => 'Доп. услуги',
            'info'  => 'Инфо',
        ]
    ]
];
