<?php

return [
    'chat'     => [
        'message_received' => 'Новое сообщение!'
    ],
    'button'   => [
        'open_order' => 'Перейти к заказе'
    ],
    'mail'     => [
        'order' => [
            'payment'             => [
                'title' => 'Заказ оформлен',
                'body'  => 'Вы оформили заказ'
            ],
            'accepting'           => [
                'seller' => [
                    'title' => 'Поступил новый заказ',
                    'body'  => 'Вы получили новый заказ от клиента. Вам необходимо подтвердить его или отклонить'
                ],
                'buyer'  => [
                    'title' => 'Заказ оплачен',
                    'body'  => 'Спасибо! Ваш заказ успешно оплачен и отправлен исполнителю!'
                ],
            ],
            'accepted'            => [
                'seller' => [
                    'title' => 'Вы приняли заказ',
                    'body'  => 'Вы взяли в работу новый заказ'
                ],
                'buyer'  => [
                    'title' => 'Ваш заказ принят',
                    'body'  => 'Над вашим заказом начали работать'
                ],
            ],
            'approving'           => [
                'seller' => [
                    'title' => 'Работа ждёт вашего одобрения!',
                    'body'  => 'Ура! Работа готова и ждёт вашего одобрения!'
                ],
                'buyer'  => [
                    'title' => 'Работа загружена',
                    'body'  => 'Ура! Вы загрузили работу, ждём одобрения!'
                ]
            ],
            'delivered'           => [
                'seller' => [
                    'title' => 'Ваша работа доставлена!',
                    'body'  => 'Ура! Работа доставлена клиенту!'
                ],
                'buyer'  => [
                    'title' => 'Заказ доставлен!',
                    'body'  => 'Поздравляем! Ваш заказ доставлен и теперь вы можете скачать из личного кабинета!'
                ]
            ],
            'cancelled_payment'   => [
                'title' => 'Заказ отменен',
                'body'  => 'Заказ был отменен'
            ],
            'cancelled_accepting' => [
                'seller' => [
                    'title' => 'Заказ отклонён',
                    'body'  => 'Вы отклонили заказ'
                ],
                'buyer'  => [
                    'title' => 'Заказ отклонён',
                    'body'  => 'К сожалению, ваш заказ был отклонен исполнителем'
                ]
            ],
            'cancelling'          => [
                'seller' => [
                    'title' => 'Отмена заказа',
                    'body'  => 'Начался процесс отмены заказа по причине:'
                ],
                'buyer'  => [
                    'title' => 'Отмена заказа',
                    'body'  => 'К сожалению, ваш заказ может быть скоро отменен по причине:'
                ]
            ],
            'declined'            => [
                'seller' => [
                    'title' => 'Заказ требует доработок',
                    'body'  => 'Клиент вернул заказ на доработку'
                ],
                'buyer'  => [
                    'title' => 'Вы попросили сделать доработки',
                    'body'  => 'Заказ снова возвращен в работу, исполнитель получил ваши комментарии'
                ]
            ]
        ]
    ],
    'database' => [
        'order' => [
            'payment'             => [
                'title' => 'Заказ оформлен',
                'body'  => 'Вы оформили заказ'
            ],
            'accepting'           => [
                'seller' => [
                    'title' => 'Поступил новый заказ',
                    'body'  => 'Вы получили новый заказ от клиента. Вам необходимо подтвердить его или отклонить'
                ],
                'buyer'  => [
                    'title' => 'Заказ оплачен',
                    'body'  => 'Спасибо! Ваш заказ успешно оплачен и отправлен исполнителю!'
                ],
            ],
            'accepted'            => [
                'seller' => [
                    'title' => 'Вы приняли заказ',
                    'body'  => 'Вы взяли в работу новый заказ'
                ],
                'buyer'  => [
                    'title' => 'Ваш заказ принят',
                    'body'  => 'Над вашим заказом начали работать'
                ],
            ],
            'approving'           => [
                'seller' => [
                    'title' => 'Работа ждёт вашего одобрения!',
                    'body'  => 'Ура! Работа готова и ждёт вашего одобрения!'
                ],
                'buyer'  => [
                    'title' => 'Работа отправлена клиенту',
                    'body'  => 'Ура! Работа готова и ждёт вашего одобрения!'
                ]
            ],
            'delivered'           => [
                'seller' => [
                    'title' => 'Ваша работа доставлена!',
                    'body'  => 'Ура! Работа доставлена клиенту!'
                ],
                'buyer'  => [
                    'title' => 'Заказ доставлен!',
                    'body'  => 'Поздравляем! Ваш заказ доставлен и теперь вы можете скачать из личного кабинета!'
                ]
            ],
            'cancelled_accepting' => [
                'seller' => [
                    'title' => 'Заказ отклонён',
                    'body'  => 'Вы отклонили заказ'
                ],
                'buyer'  => [
                    'title' => 'Заказ отклонён',
                    'body'  => 'К сожалению, ваш заказ был отклонен исполнителем'
                ]
            ],
            'cancelling'          => [
                'seller' => [
                    'title' => 'Отмена заказа',
                    'body'  => 'Начался процесс отмены заказа по причине:'
                ],
                'buyer'  => [
                    'title' => 'Отмена заказа',
                    'body'  => 'К сожалению, ваш заказ может быть скоро отменен по причине:'
                ]
            ],
            'declined'            => [
                'seller' => [
                    'title' => 'Заказ требует доработок',
                    'body'  => 'Клиент вернул заказ на доработку'
                ],
                'buyer'  => [
                    'title' => 'Вы попросили сделать доработки',
                    'body'  => 'Заказ снова возвращен в работу, исполнитель получил ваши комментарии'
                ]
            ]
        ]
    ]

];