<?php

return [

    'steps' => [
        'new_order' => 'Оформление',
        'payment'   => 'Оплата',
        'approve'   => 'Обработка',
        'work'      => 'В работе',
        'delivery'  => 'Приём заказа',
        'completed' => 'Заказ принят'
    ],

    'field' => [
        'seller' => 'Исполнитель',
        'buyer'  => 'Заказчик',
    ],

    'text' => [
        'upload_samples'  => 'Загрузите примеры',
        'id'              => 'Заказ #:0',
        'order_placed_at' => 'Заказ размещен',
        'job_cost'        => 'Стоимость работы',
        'discount'        => 'Cкидка',
        'admin_fee'       => 'Комиссия системы',
        'service_fee'     => 'Сервисный сбор',
        'upgrade_cost'    => 'Доп. опции',
        'total_cost'      => 'Итого',
        'deadline'        => 'Дата получения',
        'status'          => 'Статус',
        'chat'            => 'Чат',
        'online'          => ':login в сети',
        'was_online'      => ':login был в сети :time',
        'no_messages'     => 'Нет сообщений',
        'upload_work'     => 'Загрузить работу',
        'uploaded_works'  => 'Загруженные изображения',
        'sketch'          => 'Черновой вариант',
        'final'           => 'Финальный вариант',
        'note_to_seller'  => 'Примечание от заказчика',
        'accepting'       => 'Принять заказ',
        'approving'       => 'Принять работу',
    ],

    'status' => [
        'payment'    => 'Оплата',
        'accepting'  => 'Подтверждение заказа',
        'accepted'   => 'В работе',
        'approving'  => 'Работа на рассмотрении',
        'delivered'  => 'Работа выполнена',
        'declined'   => 'Работа отклонена',
        'cancelling' => 'Процесс отмены',
        'cancelled'  => 'Заказ отменен'
    ],

    'status_description' => [
        'seller' => [
            'payment'    => 'Ожидает оплаты покупателем',
            'accepting'  => 'Ожидает вашего подтверждения заказа',
            'accepted'   => 'Вы взяли заказ в работу',
            'approving'  => 'Заказчик должен подтвердить или отклонить работу',
            'delivered'  => 'Работа доставлена заказчику',
            'declined'   => 'Заказчик отклонил работу',
            'cancelling' => 'Процесс отмены',
            'cancelled'  => 'Заказ был отменен'
        ],
        'buyer'  => [
            'payment'    => 'Ожидает вашей оплаты',
            'accepting'  => 'Исполнитель должен подтвердить или отклонить заказ',
            'accepted'   => 'Ваш заказ в работе',
            'approving'  => 'Вы должны подтвердить или отклонить работу',
            'delivered'  => 'Заказ исполнен',
            'declined'   => 'Вы отклонили работу',
            'cancelling' => 'Процесс отмены',
            'cancelled'  => 'Заказ был отменен'
        ],
    ],

    'error' => [
        'must_be_accepted'            => 'Загрузка доступна только для статуса "В работе"',
        'cant_change_status'          => 'Невозможно изменить статус заказа',
        'final_work_must_be_uploaded' => 'Финальный вариант работы должен быть загружен',
    ],

    'button' => [
        'payment' => 'Перейти к оплате',
        'send'    => 'Отправить',
        'accept'  => 'Принять',
        'cancel'  => 'Отклонить',
        'confirm' => 'Подтвердить',
    ]
];
